Revit 2024 API
PartUtils.IsPartDerivedFromLink Method
 Is the Part derived from link geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static bool IsPartDerivedFromLink(
	Part dPart
)
Visual Basic
Public Shared Function IsPartDerivedFromLink ( _
	dPart As Part _
) As Boolean
Visual C++
public:
static bool IsPartDerivedFromLink(
	Part^ dPart
)
Parameters
dPart
Type: Autodesk.Revit.DB.Part
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartUtils Class
Autodesk.Revit.DB Namespace